Autodesk.Revit.DB.ParameterValueProvider.Parameter
The parameter used to provide a string, integer, double-precision, or ElementId
value on request for a given element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.ParameterValueProvider.#ctor(Autodesk.Revit.DB.ElementId)
Constructs an instance of ParameterValueProvider.
parameter:
The parameter used to provide a string, integer, and double-precision, or ElementId
value on request for a given element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.ParameterValueProvider
Gets the value of a parameter from any element passed to getStringValue,
getDoubleValue, getIntegerValue, or getElementIdValue.
Remarks:
For any parameter, only one of isStringValueSupported, isDoubleValueSupported,
isIntegerValueSupported, isElementIdValueSupported will return true.  No attempt
to convert between types is made.  For example, calling getStringValue, passing
the identifier of a numeric-typed parameter will give an empty string.  No
exception will be thrown, and ParameterValueProvider will not attempt to convert
the numeric value to a string.
Since:
2011